from app.news.models import News

news = [
    News(name="OpenAI в настоящее время не обучает GPT-5...",
         img="img/GPT-5.png",
         text="Эксперты, призывающие сделать паузу в развитии ИИ, будут рады услышать, что OpenAI в настоящее время не "
              "обучает GPT-5. Генеральный директор OpenAI Сэм Альтман удаленно выступил на мероприятии Массачусетского "
              "технологического института и был опрошен на тему ИИ компьютерным ученым и подкастером Лексом "
              "Фридманом.	Альтман подтвердил, что OpenAI в настоящее время не разрабатывает пятую версию своей "
              "модели Generative Pre-trained Transformer и вместо этого фокусируется на расширении возможностей "
              "GPT-4, последней версии."),
    News(name="Сбербанк представляет GigаСhat: новую нейронную сеть для многоязычного общения и творческих задач...",
         img="img/GigaChat.png",
         text="Сбербанк представил свою новую нейросеть, названную GigаСhat. На первом этапе она будет доступна в "
              "режиме тестирования по приглашениям. С помощью этой нейросети можно задавать вопросы, поддерживать "
              "диалог, писать программный код, а также создавать тексты и картинки на основе описаний в рамках "
              "единого контекста. При этом GigаСhat поддерживает мультимодальное взаимодействие и способна более "
              "грамотно общаться с пользователями на русском языке."),
    News(name="Подборка ИИ сервисов для работы с видео...",
         img="img/AI.png",
         text="В этой статье мы рассмотрим несколько ИИ-сервисов, которые могут быть использованы для работы с видео. "
              "Они предлагают различные инструменты, начиная от автоматического хромакея и создания текста в "
              "голосовой форме, заканчивая созданием видео на основе заданного текста и генерированием видео по "
              "запросу. Рассмотрим каждый из них подробнее и рассмотрим примеры, как они могут быть использованы для "
              "создания профессионального и интересного видео.</p> <p>Kaiber – это сервис, который позволяет "
              "загружать музыку и создавать видеоклипы на основе заданной темы и стиля. С помощью ИИ-алгоритмов "
              "Kaiber создает интересные и качественные видео.</p> <p>ZebraCat AI – это сервис, который генерирует "
              "видео по заданным запросам. С помощью машинного обучения и глубоких нейронных сетей ZebraCat AI "
              "создает уникальные и оригинальные видео, которые могут быть использованы для различных целей, "
              "в том числе для рекламных кампаний и продвижения бренда.</p> <p>Elai – это платформа преобразования "
              "текста в видео. С помощью ИИ и текстового анализа Elai позволяет создавать видео на основе заданного "
              "текста и озвучивать его с помощью диктора."),
]
